espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_lesense.h
/* Bit fields for LESENSE SYNCBUSY */
#define _LESENSE_SYNCBUSY_RESETVALUE                 0x00000000UL                         /**< Default value for LESENSE_SYNCBUSY          */
#define _LESENSE_SYNCBUSY_MASK                       0x00000001UL                         /**< Mask for LESENSE_SYNCBUSY                   */
#define LESENSE_SYNCBUSY_CMD                         (0x1UL << 0)                         /**< Command                                     */
#define _LESENSE_SYNCBUSY_CMD_SHIFT                  0                                    /**< Shift value for LESENSE_CMD                 */
#define _LESENSE_SYNCBUSY_CMD_MASK                   0x1UL                                /**< Bit mask for LESENSE_CMD                    */
#define _LESENSE_SYNCBUSY_CMD_DEFAULT                0x00000000UL                         /**< Mode DEFAULT for LESENSE_SYNCBUSY           */
#define LESENSE_SYNCBUSY_CMD_DEFAULT                 (_LESENSE_SYNCBUSY_CMD_DEFAULT << 0) /**< Shifted mode DEFAULT for LESENSE_SYNCBUSY   */

/* Bit fields for LESENSE IF */
#define _LESENSE_IF_RESETVALUE                       0x00000000UL                         /**< Default value for LESENSE_IF                */
#define _LESENSE_IF_MASK                             0x003FFFFFUL                         /**< Mask for LESENSE_IF                         */
#define LESENSE_IF_CH0                               (0x1UL << 0)                         /**< Channel                                     */
#define _LESENSE_IF_CH0_SHIFT                        0                                    /**< Shift value for LESENSE_CH0                 */
#define _LESENSE_IF_CH0_MASK                         0x1UL                                /**< Bit mask for LESENSE_CH0                    */
#define _LESENSE_IF_CH0_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH0_DEFAULT                       (_LESENSE_IF_CH0_DEFAULT << 0)       /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH1                               (0x1UL << 1)                         /**< Channel                                     */
#define _LESENSE_IF_CH1_SHIFT                        1                                    /**< Shift value for LESENSE_CH1                 */
#define _LESENSE_IF_CH1_MASK                         0x2UL                                /**< Bit mask for LESENSE_CH1                    */
#define _LESENSE_IF_CH1_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH1_DEFAULT                       (_LESENSE_IF_CH1_DEFAULT << 1)       /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH2                               (0x1UL << 2)                         /**< Channel                                     */
#define _LESENSE_IF_CH2_SHIFT                        2                                    /**< Shift value for LESENSE_CH2                 */
#define _LESENSE_IF_CH2_MASK                         0x4UL                                /**< Bit mask for LESENSE_CH2                    */
#define _LESENSE_IF_CH2_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH2_DEFAULT                       (_LESENSE_IF_CH2_DEFAULT << 2)       /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH3                               (0x1UL << 3)                         /**< Channel                                     */
#define _LESENSE_IF_CH3_SHIFT                        3                                    /**< Shift value for LESENSE_CH3                 */
#define _LESENSE_IF_CH3_MASK                         0x8UL                                /**< Bit mask for LESENSE_CH3                    */
#define _LESENSE_IF_CH3_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH3_DEFAULT                       (_LESENSE_IF_CH3_DEFAULT << 3)       /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH4                               (0x1UL << 4)                         /**< Channel                                     */
#define _LESENSE_IF_CH4_SHIFT                        4                                    /**< Shift value for LESENSE_CH4                 */
#define _LESENSE_IF_CH4_MASK                         0x10UL                               /**< Bit mask for LESENSE_CH4                    */
#define _LESENSE_IF_CH4_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH4_DEFAULT                       (_LESENSE_IF_CH4_DEFAULT << 4)       /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH5                               (0x1UL << 5)                         /**< Channel                                     */
#define _LESENSE_IF_CH5_SHIFT                        5                                    /**< Shift value for LESENSE_CH5                 */
#define _LESENSE_IF_CH5_MASK                         0x20UL                               /**< Bit mask for LESENSE_CH5                    */
#define _LESENSE_IF_CH5_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH5_DEFAULT                       (_LESENSE_IF_CH5_DEFAULT << 5)       /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH6                               (0x1UL << 6)                         /**< Channel                                     */
#define _LESENSE_IF_CH6_SHIFT                        6                                    /**< Shift value for LESENSE_CH6                 */
#define _LESENSE_IF_CH6_MASK                         0x40UL                               /**< Bit mask for LESENSE_CH6                    */
#define _LESENSE_IF_CH6_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH6_DEFAULT                       (_LESENSE_IF_CH6_DEFAULT << 6)       /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH7                               (0x1UL << 7)                         /**< Channel                                     */
#define _LESENSE_IF_CH7_SHIFT                        7                                    /**< Shift value for LESENSE_CH7                 */
#define _LESENSE_IF_CH7_MASK                         0x80UL                               /**< Bit mask for LESENSE_CH7                    */
#define _LESENSE_IF_CH7_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH7_DEFAULT                       (_LESENSE_IF_CH7_DEFAULT << 7)       /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH8                               (0x1UL << 8)                         /**< Channel                                     */
#define _LESENSE_IF_CH8_SHIFT                        8                                    /**< Shift value for LESENSE_CH8                 */
#define _LESENSE_IF_CH8_MASK                         0x100UL                              /**< Bit mask for LESENSE_CH8                    */
#define _LESENSE_IF_CH8_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH8_DEFAULT                       (_LESENSE_IF_CH8_DEFAULT << 8)       /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH9                               (0x1UL << 9)                         /**< Channel                                     */
#define _LESENSE_IF_CH9_SHIFT                        9                                    /**< Shift value for LESENSE_CH9                 */
#define _LESENSE_IF_CH9_MASK                         0x200UL                              /**< Bit mask for LESENSE_CH9                    */
#define _LESENSE_IF_CH9_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH9_DEFAULT                       (_LESENSE_IF_CH9_DEFAULT << 9)       /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH10                              (0x1UL << 10)                        /**< Channel                                     */
#define _LESENSE_IF_CH10_SHIFT                       10                                   /**< Shift value for LESENSE_CH10                */
#define _LESENSE_IF_CH10_MASK                        0x400UL                              /**< Bit mask for LESENSE_CH10                   */
#define _LESENSE_IF_CH10_DEFAULT                     0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH10_DEFAULT                      (_LESENSE_IF_CH10_DEFAULT << 10)     /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH11                              (0x1UL << 11)                        /**< Channel                                     */
#define _LESENSE_IF_CH11_SHIFT                       11                                   /**< Shift value for LESENSE_CH11                */
#define _LESENSE_IF_CH11_MASK                        0x800UL                              /**< Bit mask for LESENSE_CH11                   */
#define _LESENSE_IF_CH11_DEFAULT                     0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH11_DEFAULT                      (_LESENSE_IF_CH11_DEFAULT << 11)     /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH12                              (0x1UL << 12)                        /**< Channel                                     */
#define _LESENSE_IF_CH12_SHIFT                       12                                   /**< Shift value for LESENSE_CH12                */
#define _LESENSE_IF_CH12_MASK                        0x1000UL                             /**< Bit mask for LESENSE_CH12                   */
#define _LESENSE_IF_CH12_DEFAULT                     0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH12_DEFAULT                      (_LESENSE_IF_CH12_DEFAULT << 12)     /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH13                              (0x1UL << 13)                        /**< Channel                                     */
#define _LESENSE_IF_CH13_SHIFT                       13                                   /**< Shift value for LESENSE_CH13                */
#define _LESENSE_IF_CH13_MASK                        0x2000UL                             /**< Bit mask for LESENSE_CH13                   */
#define _LESENSE_IF_CH13_DEFAULT                     0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH13_DEFAULT                      (_LESENSE_IF_CH13_DEFAULT << 13)     /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH14                              (0x1UL << 14)                        /**< Channel                                     */
#define _LESENSE_IF_CH14_SHIFT                       14                                   /**< Shift value for LESENSE_CH14                */
#define _LESENSE_IF_CH14_MASK                        0x4000UL                             /**< Bit mask for LESENSE_CH14                   */
#define _LESENSE_IF_CH14_DEFAULT                     0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH14_DEFAULT                      (_LESENSE_IF_CH14_DEFAULT << 14)     /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CH15                              (0x1UL << 15)                        /**< Channel                                     */
#define _LESENSE_IF_CH15_SHIFT                       15                                   /**< Shift value for LESENSE_CH15                */
#define _LESENSE_IF_CH15_MASK                        0x8000UL                             /**< Bit mask for LESENSE_CH15                   */
#define _LESENSE_IF_CH15_DEFAULT                     0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CH15_DEFAULT                      (_LESENSE_IF_CH15_DEFAULT << 15)     /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_SCANDONE                          (0x1UL << 16)                        /**< Scan Done                                   */
#define _LESENSE_IF_SCANDONE_SHIFT                   16                                   /**< Shift value for LESENSE_SCANDONE            */
#define _LESENSE_IF_SCANDONE_MASK                    0x10000UL                            /**< Bit mask for LESENSE_SCANDONE               */
#define _LESENSE_IF_SCANDONE_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_SCANDONE_DEFAULT                  (_LESENSE_IF_SCANDONE_DEFAULT << 16) /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_DEC                               (0x1UL << 17)                        /**< Decoder                                     */
#define _LESENSE_IF_DEC_SHIFT                        17                                   /**< Shift value for LESENSE_DEC                 */
#define _LESENSE_IF_DEC_MASK                         0x20000UL                            /**< Bit mask for LESENSE_DEC                    */
#define _LESENSE_IF_DEC_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_DEC_DEFAULT                       (_LESENSE_IF_DEC_DEFAULT << 17)      /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_RESWL                             (0x1UL << 18)                        /**< Result Watermark Level                      */
#define _LESENSE_IF_RESWL_SHIFT                      18                                   /**< Shift value for LESENSE_RESWL               */
#define _LESENSE_IF_RESWL_MASK                       0x40000UL                            /**< Bit mask for LESENSE_RESWL                  */
#define _LESENSE_IF_RESWL_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_RESWL_DEFAULT                     (_LESENSE_IF_RESWL_DEFAULT << 18)    /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_RESOF                             (0x1UL << 19)                        /**< Result Overflow                             */
#define _LESENSE_IF_RESOF_SHIFT                      19                                   /**< Shift value for LESENSE_RESOF               */
#define _LESENSE_IF_RESOF_MASK                       0x80000UL                            /**< Bit mask for LESENSE_RESOF                  */
#define _LESENSE_IF_RESOF_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_RESOF_DEFAULT                     (_LESENSE_IF_RESOF_DEFAULT << 19)    /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_CNTOF                             (0x1UL << 20)                        /**< Counter Overflow                            */
#define _LESENSE_IF_CNTOF_SHIFT                      20                                   /**< Shift value for LESENSE_CNTOF               */
#define _LESENSE_IF_CNTOF_MASK                       0x100000UL                           /**< Bit mask for LESENSE_CNTOF                  */
#define _LESENSE_IF_CNTOF_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_CNTOF_DEFAULT                     (_LESENSE_IF_CNTOF_DEFAULT << 20)    /**< Shifted mode DEFAULT for LESENSE_IF         */
#define LESENSE_IF_RESUF                             (0x1UL << 21)                        /**< Result Underflow                            */
#define _LESENSE_IF_RESUF_SHIFT                      21                                   /**< Shift value for LESENSE_RESUF               */
#define _LESENSE_IF_RESUF_MASK                       0x200000UL                           /**< Bit mask for LESENSE_RESUF                  */
#define _LESENSE_IF_RESUF_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for LESENSE_IF                 */
#define LESENSE_IF_RESUF_DEFAULT                     (_LESENSE_IF_RESUF_DEFAULT << 21)    /**< Shifted mode DEFAULT for LESENSE_IF         */

